app/views/books/show.html.erb

SELECT COUNT(people) FROM `likes` WHERE `likes`.`book_id` = 1
---
<hr>
  <%= @book.likes.count  %>

SELECT COUNT(*) FROM `reviews` WHERE `reviews`.`book_id` = 1
SELECT `reviews`.* FROM `reviews` WHERE `reviews`.`book_id` = 1
---
<h2> Reviews </h2>
<%if @book.reviews.empty? %>