app/controllers/books_controller.rb

  def edit
#    if !@is_current_uer_admin?
  if(current_user && current_user.is_admin?)
      @book = Book.find(params[:id])
---
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @book = Book.new(params[:book])

    respond_to do |format|
      if @book.save
---
INSERT INTO "books" ("author", "book_type", "created_at", "description", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["author", nil], ["book_type", nil], ["created_at", Sat, 23 Mar 2013 13:50:15 UTC +00:00], ["description", nil], ["title", "MyString"], ["updated_at", Sat, 23 Mar 2013 13:50:15 UTC +00:00]]

  def update
#    @book = Book.find(params[:id])

    respond_to do |format|
      if @book.update_attributes(params[:book])
---
UPDATE `books` SET `description` = 'Ruby use book, good for beginner', `updated_at` = '2013-03-23 14:38:56' WHERE `books`.`id` = 2

  def destroy
#    @book = Book.find(params[:id])
    @book.destroy
---
DELETE FROM "books" WHERE "books"."id" = ?  [["id", 1]]

def find_book
#  @book = Book.find(params[:id])
  @book = Book.find( params[:book_id] || params[:id])
---
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", "1"]]