app/controllers/likes_controller.rb

INSERT INTO `likes` (`book_id`, `created_at`, `updated_at`, `user_id`) VALUES (1, '2013-03-23 23:52:56', '2013-03-23 23:52:56', 1)
---
  def create
    @like = Like.new
	@like.user = current_user
	@like.book = @book
	if !current_user.has_liked?(@book) && @like.save

SELECT `likes`.* FROM `likes` WHERE `likes`.`id` = 1 LIMIT 1
DELETE FROM `likes` WHERE `likes`.`id` = 1
---
  def destroy
    @like = Like.find(params[:id])
    if @like.destroy