app/controllers/reviews_controller.rb

def index
  @reviews = Review.all
---
SELECT `reviews`.* FROM `reviews`

  def create
   @review = Review.new(params[:review])
   @review.book = @book
   if @review.save
---
INSERT INTO `reviews` (`book_id`, `content`, `created_at`, `title`, `updated_at`) VALUES (NULL, 'I recommand this book', '2013-03-23 16:08:25', NULL, '2013-03-23 16:08:25')

  def edit
    @review = Review.find(params[:id])
---
SELECT `reviews`.* FROM `reviews` WHERE `reviews`.`id` = 1 LIMIT 1

def find_review
  @review = Review.find(params[:id] )
---
SELECT `reviews`.* FROM `reviews` WHERE `reviews`.`id` = 1 LIMIT 1